src/Documents/Списание/Списание.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Списание</name>
  <registerRecords>AccumulationRegister.ОстаткиТоваров</registerRecords>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>DefinedType.Комментарий</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаСписания</name>
    <type>
      <types>EnumRef.ПричиныСписания</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>DefinedType.Количество</types>
      </type>
    </attributes>
    <attributes>
      <name>Себестоимость</name>
      <type>
        <types>DefinedType.Цена</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

src/Documents/Списание/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	
	ПередЗаписьюНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере()

	СписокТоваров = Объект.Товары.Выгрузить(,"Номенклатура");
	ТЗСебестоимость = ОбщегоНазначения.ПолучитьСебестоимостьТоваров(СписокТоваров, Объект.Дата);
	
	Для Каждого СтрокаТЧ Из Объект.Товары Цикл
		СтрокаТЗ = ТЗСебестоимость.Найти(СтрокаТЧ.Номенклатура, "Номенклатура");
		СтрокаТЧ.Себестоимость = СтрокаТЗ.ЦенаЗаЕдиницу * СтрокаТЧ.Количество;
	КонецЦикла;
	
	Объект.СуммаДокумента = Объект.Товары.Итог("Себестоимость");

КонецПроцедуры // ПередЗаписьюНаСервере()
